#!/usr/bin/env python
# -*- coding: utf-8 -*-
# 모듈 로딩 ------------------------------------------
import numpy as np
import cv2

# 흰색 캔버스 생성 -------------------------------------
img=np.full((512,512, 3), 255, dtype=np.uint8)

# 도형 그리기 -----------------------------------------
cv2.line(img, (10, 10), (350, 350), (0, 0,255), 3)
cv2.rectangle(img, (50, 50), (250, 250), (255, 0, 0), -1) # 테두리에 -1을 넣으면 채워짐
cv2.circle(img, (300, 300), 50, (0, 255, 255), -1)
cv2.circle(img, (450, 450), 5, (0, 0, 255), 3)

# 글자 그리기 -----------------------------------------
font = cv2.FONT_HERSHEY_COMPLEX
cv2.putText(img, "GOOD", (200, 450), font, 3, (255, 255, 0), 5)

# 윈도우 창에 이미지 띄우기 ------------------------------
cv2.imshow("[ My Canvas ]", img)

# 키 이벤트 처리 ---------------------------------------
cv2.waitKey()
cv2.destroyAllWindows()
